Architectural Lines - Short 45 degree lines which angle through extension lines to indicate dimensions
Balcony - A gallery or platform, either cantilevered or supported, that projects from the wall of a building and is enclosed by a guardrail.
Barge board - The finished board covering the gable rafter on a gable roof. 
Basement - The lower storey of a building below or partly below ground level.
Beam - A horizontal structural member supported at two or more points.
Bedrock -  Solid rock underlying superficial material; may be exposed at the surface.
Below grade - Any part of a structure or site feature that is below the adjacent finished ground level.
Bevel - The sloping surface formed when two surfaces meet at an angle other than a right angle.
Blocking - Small wood pieces used between framing members for bracing and to provide support for the attachment of drywall, shelving and cabinet.
Bollard - A wood, concrete, or metal post used to prevent vehicles from entering or leaving an area. A short post containing an electrical outlet 
Border Lines - Heaviest line type encloses the drawing.
Bottom plate - The lower horizontal member of a wood frame wall nailed to the bottom of the wall studs and to the floor framing members. Also called sole plate.
Braced framing - Supported framework of a house, specifically required at corners. 
Break Line - A break line is used to shorten the view by eliminating any detail that is not required or when the entire view is not possible.
Bridging - A method used to resist twisting of joists and for stiffening floor construction by fitting either crossed pieces or solid blocks between the joists. 
Building paper - A heavy paper usually impregnated with bitumen and applied under or behind exterior finish materials in wood frame construction to protect the assembly from liquid water.
Built up roof - A roof covering consisting of layers of roofing felt laid in pitch or asphalt. The top is finished with crushed stone, gravel, or a cap sheet. Generally used on flat or low pitched roofs. 
Cantilever - A structural member that projects beyond a supporting column or wall and is counterbalanced or supported at only one end (for example, cantilevered beams may be used to support a balcony).
Cant strip - A wedge or triangular shaped piece generally installed on flat roofs around the perimeter or at the junction of the roof and adjoining wall. 
Cap - The upper half of the top plate in wood frame walls
Carport - A roofed but otherwise open shelter located adjacent to a dwelling for a vehicle.
Casing - Decorative trim used to cover the gap between the wall finish and window and door frames.
Ceiling - The overhead inside surface of a room.
Ceiling, dropped - A non structural, secondary ceiling suspended below an existing ceiling or a roof or floor structure. It may be framed and finished in a manner consistent with the surrounding construction or consist of a modular grid of prefabricated light weight panels and suspension system. A dropped ceiling is usually provided to contain, conceal and provide passage space for lighting, wiring, plumbing, heating, ventilating and air conditioning systems. May also be referred to as a false or suspended ceiling.
Ceiling joist - One of a series of horizontal structural members typically used in conjunction with rafters or roof joists in the roof structure. They form the horizontal separation between the occupied space and the attic or roof space above, and support the ceiling. Ceiling joists may secure the lower portion of opposing rafters to prevent them from spreading and may support knee walls within the roof space. 
Center lines - Alternating long and short dashed lines indicate the center of symmetrical items and as an aid in dimensioning.
Column - A vertical structural member consisting of one or more components acting together and loaded in the direction of its longitudinal axis.
Contour line - A plotted line on a map or plan that joins points of equal altitude or elevation. Also called contour.
Construction Line - Used as a reference for use before object line locations are certain.
Cripple - Short vertical framing installed to transfer load from a top plate to a window or door lintel and partitions. 
Cross bridging - Diagonal wood braces placed between floor joists to increase stiffness and reduce deflection. 
Cutting Plane Lines - Cutting plane lines which show where the cutting plane passes through the object, represent the edge view of the cutting plane and are drawn in the view(s) adjacent to the section view. Two types of lines are acceptable for cutting plane lines in multiview drawings. It is important to use only one type of cutting plane line on a single drawing.
Dimension Lines - Thin unbroken lines that show the width or size of objects. Typically have arrowheads on the ends.
Dot lines - Dot lines are lines that end in dots and are used to indicate dimensions.
Engineering Lines - Engineering lines point to the end of the line at the extension lines to indicate dimensions.
Extensions Lines - Short, solid lines used to show the limits of dimensions extending from an outline or surface.
Framing system - The integration of floor, wall and roof assemblies which make a structural unit.
Guide Line - Used as a guide for lettering, very light type of construction line. Header  (1) A wood member at right angles to a series of joists or rafters and attached to the joists or rafters.  (2) When used at openings in the floor or roof system, the header supports the joist or rafters and acts as a beam. 
Header, Double header - A structural member made by nailing or bolting two joists together for use where extra strength is required in the header, as at stair openings. 
Heel cut - A notch cut in the end of a rafter to permit it to have a flat bearing area on a wall top plate. 
Hidden line - Dashed line indicates the surface of obstructed / hidden object.
Jack rafter - A short rafter that spans from the wall plate to a hip rafter or from a valley rafter to the roof ridge. 
Jack stud - A block or short stud nailed to a rough door or window studding to add strength and provide a solid bearing for the lintel and nailing support for the finished door jamb or window frame. 
Joist - One of a series of horizontal or inclined wood members, usually 50 mm nominal thickness, used for support in floors, ceilings or roofs. 
Leader Lines - Leader lines indicate the part or area of a drawing to which a number, note or other reference applies, terminating in a single arrowhead.
Let in brace - A brace that is inset into grooves in the wall studs it is bracing, leaving a flat surface on the braced side. 
Load bearing wall - A wall designed to transfer loads from a roof or floor above to a floor, beam or foundation below.
Lookout rafter - A short wood member cantilevered over, or projecting from, a wall to support an overhanging portion of a roof.
Mullion - A vertical member between adjacent window or door units. Mullions may be structural when used to support a lintel above a window or door opening. Also refers to the vertical member between two adjacent doors against which the doors close, latch and sometimes lock. 
Object line - Also called visible lines, object lines are used to show the main outline of the building, including exterior walls, interior partitions, porches, patios, driveways, and walls. These lines should stand out on a drawing.
Outrigger - An extension of a rafter beyond the wall line.
Phantom Lines - Phantom lines are drawn by alternating long and 2 short lines to symbolize a variety of objects. Phantom lines are used to indicate alternate positions of the parts of an object.
Plank framing - A type of construction that employs flat vertical structural members with horizontal beams let into them and that has an infilling of planks on edge. 
Platform framing - A system of framing a building in which floor joists of each storey rest on the top plates of the storey below or on the foundation sill for the first storey, and the bearing walls and partitions rest on the subfloor of each storey. 
Plot Plan - The Plot Plan is an aerial view usually located in the top right hand corner of the 1st sheet showing property lines / utility services / trees / fencing and any existing buildings (bldg) on the site.
Pony wall - An interior low wall used to visually subdivide rooms, a low framed wall built atop a foundation wall to support the floor joists of the first storey of a building.
Post and beam framing - A system of construction in which posts and beams support the loads and the infilling walls are non load bearing. 
Rafter - An inclined structural roof member, usually of 38 mm (1.5 in.) thickness, designed to support roof loads, but not ceiling finish built on site.
Revision Block - The Revision block is usually found above or to the immediate left of the titleblock.
Ribband - A piece of lumber notched into or nailed onto the back of studs to support floor joists or ceiling joists in balloon frame construction. Also known as a ribbon or a ledger. 
Ridge beam - A horizontal structural member usually 50 mm (2 in.) thick or greater, supporting the upper ends of rafters. 
Ridge board - A horizontal member, usually 18 mm (0.7 in.) thick, at the upper end of the rafters, to which abutting rafters are nailed. 
Rim board - In engineered wood floor construction, the vertical framing around the edge of a floor for the purpose of transferring vertical loads from one floor to another, and to secure the floor joists. 
Rim joist or header joist - For floors framed with dimension lumber, a joist that runs around the perimeter of the floor joists, and to which the floor joists are attached. 
Sectional drawings - Multiview technical drawings that contain special views of a part or parts, a view that reveal interior features. In the figure a regular multiview drawing and a sectioned multiview drawing of the same part in the front view, the hidden features can be seen after sectioning.
Section Lines - Section lines distinguish between two separate parts that meet at a given point.
Section views - Section views are a very important aspect of design and documentation and are used to improve clarity and reveal interior features of parts.
Sill plate - A structural member anchored to the top of a foundation wall, upon which the floor joists rest. 
Stud - One of a series of regularly spaced wood structural members (usually 50 mm (2 in.) nominal thickness) used for walls and partitions.
Tail piece - A relatively short beam, joist or rafter, supported on one end by a header. 
Threshold - A shaped wood or metal strip used on top of exterior door sills to separate and protect the interior flooring from exterior elements or to bridge and finish two different floor finishes at interior doorway locations. A threshold may be beveled to gently slope out of the doorway on either side.
Title Block - The Title block is usually found at the bottom right hand corner (large sheet) and across the bottom (small sheet) such as fabrication or shop dwgs.
Toenailing - Fastening one piece of lumber to another by nailing through the first at an angle into the second. Usually done when it is not possible to lap or align the two pieces in such a way to allow perpendicular nailing. Toe nailing at opposite angles can increase the strength of the joint. 
Top plate - The horizontal member nailed to the top of the partition or wall studs and usually doubled to transfer loads from above into the wall studs. Transom(1) The horizontal bar that divides a window into heights or stages. (2) The opening above a door or window used for light or ventilation.
Trimmer - A beam or joist alongside an opening and into which a header is framed.
Valley - The concave area formed by the junction of two sloping surfaces of a roof.
Wall plate (top or bottom plates) - A horizontal member attached to the tops and bottoms of wood stud walls.
Window, awning window - A frame containing one or more sashes, each of which is installed in a vertical plane and is hinged to permit the bottom of the sash to open outward.
Window, double hung window - A window with an upper and lower sash, each balanced by springs or weights to be capable of vertical movement with relatively little effort.
Window, muntin - A thin member that frames and holds individual panes of glass, or individual glazing units, within a window. In newer windows, muntins are often decorative grid like assemblies applies over a larger glazed units, or in between the individual panes, to visually subdivide it into smaller, more architecturally attractive, areas.
Window, pane - A glass surface in a window. A window may consist of a single pane or may include a number of panes (double or triple pane).
Window, rough frame - The framing of the enclosure in which the finished window frame is placed.
Window, single hung sash - A sash in a window frame containing a pair of vertical sliding sashes in which only one sash is movable, usually the lower, in contrast to a double hung sash.
Window well - Corrugated metal, concrete or timber barrier wall installed around a basement window to hold back backfill.